package eleme.openapi.sdk.api.enumeration.shop;

public enum OShopProperty {
    /**
     * String 店铺地址|可选|"上海市长宁区龙溪路虹桥路1923号"
     */
    addressText("addressText"), 
    /**
     * String 经纬度，longitude和latitude用英文逗号分隔|可选|"111.223,22.233"
     */
    geo("geo"), 
    /**
     * double 配送费|可选|3.0
     */
    agentFee("agentFee"), 
    /**
     * String 关店描述信息|可选|"业务繁忙"
     */
    closeDescription("closeDescription"), 
    /**
     * String 配送区域说明|可选|"超过5公里，100元起送"
     */
    deliverDescription("deliverDescription"), 
    /**
     * 配送范围||{ "type": "FeatureCollection",  "features": [{"geometry": {"type": "Polygon", "coordinates": [[[121.381303, 31.243521], [121.380938, 31.242778], [121.380735, 31.242421], [121.380627, 31.242196], [121.380541, 31.24204], [121.38037, 31.241664], [121.380284, 31.241499], [121.38023, 31.241389], [121.380166, 31.241269], [121.380134, 31.241178], [121.379951, 31.24093], [121.379748, 31.24071], [121.379565, 31.240499], [121.379426, 31.24037], [121.379297, 31.240205], [121.379104, 31.239967], [121.378911, 31.239747], [121.378696, 31.239471], [121.377881, 31.238554], [121.377291, 31.237848], [121.376561, 31.237077], [121.37566, 31.236013], [121.375123, 31.235435], [121.374684, 31.234967], [121.374265, 31.234499], [121.374126, 31.23427], [121.374072, 31.234105], [121.374029, 31.233912], [121.3739, 31.233334], [121.373782, 31.232738], [121.373675, 31.232334], [121.3736, 31.231967], [121.373342, 31.230821], [121.374319, 31.23038], [121.375542, 31.22983], [121.377065, 31.229133], [121.377913, 31.228775], [121.378857, 31.228545], [121.37964, 31.228399], [121.381539, 31.228096], [121.382891, 31.227903], [121.38361, 31.229628], [121.384661, 31.231977], [121.385713, 31.23449], [121.386753, 31.236527], [121.386764, 31.236554], [121.387183, 31.237426], [121.387504, 31.238095], [121.388213, 31.239499], [121.388695, 31.24049], [121.387912, 31.240701], [121.386839, 31.240985], [121.385766, 31.241315], [121.385251, 31.241389], [121.383728, 31.24226], [121.381582, 31.243361], [121.381679, 31.243297], [121.381303, 31.243521]]]}, "type": "Feature","properties": {"area_agent_fee": 20,"delivery_price": 10, "manual_weight": 0,"system_weight": 0,"weight_type": 1}}]}
     */
    deliverGeoJson("deliverGeoJson"), 
    /**
     * String 店铺简介|可选|"便宜好吃的小食"
     */
    description("description"), 
    /**
     * String 店铺名称|可选|"烤鸭大王"
     */
    name("name"), 
    /**
     * int 是否接受预定|可选|1
     */
    isBookable("isBookable"), 
    /**
     * String 店铺营业时间|可选|"10:00-13:00,18:00-21:00"
     */
    openTime("openTime"), 
    /**
     * String 店铺联系电话|可选|"18516307705,13482893679"
     */
    phone("phone"), 
    /**
     * String 店铺公告信息|可选|"本周全场半价"
     */
    promotionInfo("promotionInfo"), 
    /**
     * String 店铺Logo的图片imageHash|可选|"3077080f760e7bf0fc985e23dd3e36e2"
     */
    logoImageHash("logoImageHash"), 
    /**
     * int 是否支持开发票|可选|1
     */
    invoice("invoice"), 
    /**
     * double 支持的最小发票金额|可选|100.0
     */
    invoiceMinAmount("invoiceMinAmount"), 
    /**
     * double 满xx元免配送费|可选|20.0
     */
    noAgentFeeTotal("noAgentFeeTotal"), 
    /**
     * int 是否营业|可选|1
     */
    isOpen("isOpen"), 
    /**
     * double 订单打包费|可选|2.0
     */
    packingFee("packingFee"), 
    /**
     * String 餐厅的外部唯一标识|可选|"2132123213123"
     */
    openId("openId");

    private String shopDesc;
    OShopProperty(String shopDesc) {
        this.shopDesc = shopDesc;
    }
}